# --------------------------------
# hello worldと表示するプログラム
# 出力する文字列をダブルクオーテーション「"」で囲む必要があります
# Ctrl + F5 で実行できます
# 実行できないときは「Fn」ボタンの右上のLEDが光っているか確認してください

print("hello world")


# --------------------------------
# コメントアウトすると、その行はプログラムとして実行されません
# Ctrl + / でコメントアウトできます
# もう一度 Ctrl + / でコメントアウトを解除できます

# print("hello world1")


# --------------------------------
# 自由に文章を出力してみましょう

# print("ざわ。。ざわ。。")


# --------------------------------
# 複数行選択してCtrl + / で選択した行をまとめてコメントアウトできます
# もう一度 Ctrl + / でコメントアウトを解除できます

# print("hello world2")
# print("hello world3")
# print("hello world4")


# --------------------------------
# 足し算や引き算を計算できます

# print(8 + 4)
# print(8 - 4)
# print(8 * 4)
# print(8 / 4)


# --------------------------------
# 変数に値を代入して表示するプログラム
# 変数を出力する場合はダブルクオーテーション「"」で囲みません

# a = 8
# b = 4
# print(a)
# print(b)
# print(a + b)

# # 計算結果を別の変数に入れて出力できます
# c = a - b
# print(c)

# # 普通の算数とは違うやりかたで自分自身に値を足すこともできます
# a = a + 5
# print(a)